// // // // // // // // // 1. Якщо змінна a дорівнює нулю, то виведіть 'Вірно', інакше виведіть 'Невірно'.
// // // // // // // // //     Перевірте роботу скрипта при a, що дорівнює 1, 0, -3
// // // // // // // // //
// // // // // // // // // 2. В змінної min лежить число від 0 до 59.
// // // // // // // // // Визначте в яку чверть години потрапляє це число (в першу, другу, третю або четверту).
// // // // // // // // //
// // // // // // // // // 3.Якщо змінна a дорівнює або менше 1, а змінна b більше або дорівнює 3,
// // // // // // // // //     то виведіть суму цих змінних,
// // // // // // // // //     інакше виведіть їх різницю (результат віднімання).
// // // // // // // // // Перевірте роботу скрипта при a і b, що дорівнює 1 і 3, 0 і 6, 3 і 5.
// // // // // // // // //
// // // // // // // // // 4. В змінної month лежить якесь число з інтервалу від 1 до 12.
// // // // // // // // // Визначте в яку пору року потрапляє цей місяць (зима, літо, весна, осінь).
// // // // // // // // //
// // // // // // // // // 5. switch
// // // // // // // // //     Переменная num может принимать 4 значения: 1, 2, 3 или 4.
// // // // // // // // //         Если она имеет значение '1', то в переменную result запишем 'зима',
// // // // // // // // //             если имеет значение '2' – 'весна' и так далее.
// // // // // // // // //
// // // // // // // // //         6. Переменная num может принимать 12 значений: 1, 2 ..... 12.
// // // // // // // // //         Если она имеет значение '1', то в переменную result запишем 'январь',
// // // // // // // // //             если имеет значение '2' – 'февраль' и так далее.
// // // // // // // //
// // // // // // // //
// // // // // // // // let x = -.1;
// // // // // // // //
// // // // // // // // //
// // // // // // // // // if (!x) {
// // // // // // // // //     console.log('X === 0');
// // // // // // // // // } else {
// // // // // // // // //     console.log('NE OK');
// // // // // // // // // }
// // // // // // // //
// // // // // // // //
// // // // // // // // x === 0 ? console.log('X === 0') : console.log('X HE 0');
// // // // // // // //
// // // // // // // //
// // // // // // // // let m = Math.round(Math.random() * 59);
// // // // // // // //
// // // // // // // // console.log(m);
// // // // // // // //
// // // // // // // // if (m < 15) {
// // // // // // // //     console.log(1);
// // // // // // // // } else if (m >= 15 && m < 30) {
// // // // // // // //     console.log(2);
// // // // // // // // } else if (m >= 30 && m < 45) {
// // // // // // // //     console.log(3);
// // // // // // // // } else if (m >= 45 && m < 59) {
// // // // // // // //     console.log(4);
// // // // // // // // } else {
// // // // // // // //     console.log('WRONG NUMBER');
// // // // // // // // }
// // // // // // // //
// // // // // // // //
// // // // // // // // let season = Math.round(Math.random() * (4 - 1) + 1);
// // // // // // // //
// // // // // // // // console.log(season);
// // // // // // // //
// // // // // // // // switch (season) {
// // // // // // // //     case 1:
// // // // // // // //         console.log('Zima');
// // // // // // // //         break;
// // // // // // // //     case 2:
// // // // // // // //         console.log('Vesna');
// // // // // // // //         break;
// // // // // // // //     case 3:
// // // // // // // //         console.log('Lito');
// // // // // // // //         break;
// // // // // // // //     case 4:
// // // // // // // //         console.log('OSIN');
// // // // // // // //         break;
// // // // // // // //     default:
// // // // // // // //         console.log('Not our planet');
// // // // // // // // }
// // // // // // //
// // // // // // //
// // // // // // //
// // // // // // //
// // // // // // // // Все параметры получаем с клавиатуры!!!!(prompt , confirm)
// // // // // // // // Создать переменную isRoadClear которая характеризирует наличие на дороге машин.
// // // // // // // // Улучшаем предыдущее задание.
// // // // // // // // Если светофор зеленый и машин нет - вывести "иди".
// // // // // // // // Если светофор зеленый и машины есть  - вывести подожди пока нарушители проедут".
// // // // // // // // Если светофор желтый и машины есть - вывести "жди".
// // // // // // // // Если светофор желтый и машин нет - вывести "все рано жди".
// // // // // // // // Если светофор красный и машин нет- вывести "стой все рано".
// // // // // // // // Если светофор красный - и машины есть вывести "стой и жди".
// // // // // // // // Если светофор в аварийном режиме вывести "делай что хочешь"!
// // // // // // //
// // // // // // // const color = prompt('ENTER COLOR');
// // // // // // // const isRoadClear = confirm('IS ROAD CLEAR?');
// // // // // // //
// // // // // // // if (isRoadClear) {
// // // // // // //     if (color === 'green') {
// // // // // // //         console.log('GO');
// // // // // // //     } else if (color === 'yellow') {
// // // // // // //
// // // // // // //     } else if (color === 'red') {
// // // // // // //
// // // // // // //     } else {
// // // // // // //         console.log('WRONG');
// // // // // // //     }
// // // // // // // } else {
// // // // // // //     if (color === 'green') {
// // // // // // //         console.log('STILL WAIT');
// // // // // // //     } else if (color === 'yellow') {
// // // // // // //
// // // // // // //     } else if (color === 'red') {
// // // // // // //
// // // // // // //     } else {
// // // // // // //         console.log('WRONG');
// // // // // // //     }
// // // // // // // }
// // // // // //
// // // // // //
// // // // // // // зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// // // // // // // 1. перебрати його циклом while
// // // // // // // 2. перебрати його циклом for
// // // // // // // 3. перебрати циклом while та вивести  числа тільки з непарним індексом
// // // // // // // 4. перебрати циклом for та вивести  числа тільки з непарним індексом
// // // // // // // 5. перебрати циклом while та вивести  числа тільки парні  значення
// // // // // // // 6. перебрати циклом for та вивести  числа тільки парні  значення
// // // // // // // 7. замінити кожне число кратне 3 на слово "okten"
// // // // // // // 8. вивести масив в зворотньому порядку.
// // // // // // // 9. всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// // // // // // // 10
// // // // // // // створити пустий масив та :
// // // // // // //     - заповнити його 50 парними числами за допомоги циклу.
// // // // // // // - заповнити його 50 непарними числами за допомоги циклу.
// // // // // //
// // // // // // let arr = [2, 17, 13, 6, 22, 31, 45, 66, 100, -18];
// // // // // //
// // // // // // // for (let i = 0; i < arr.length; i++) {
// // // // // // //     console.log(arr[i]);
// // // // // // // }
// // // // // // //
// // // // // // // console.log('_____________________');
// // // // // // //
// // // // // // // for (const number of arr) {
// // // // // // //     console.log(number);
// // // // // // // }
// // // // // // //
// // // // // // // console.log('_____________________');
// // // // // //
// // // // // // // let i = 0;
// // // // // // // while (i < arr.length) {
// // // // // // //     if (!(i % 2)) {
// // // // // // //         console.log(arr[i], `INDEX ${i}`);
// // // // // // //     }
// // // // // // //     i++;
// // // // // // // }
// // // // // //
// // // // // // // let i = 0;
// // // // // // // while (i < arr.length) {
// // // // // // //     if (!(arr[i] % 2)) {
// // // // // // //         console.log(arr[i]);
// // // // // // //     }
// // // // // // //     i++;
// // // // // // // }
// // // // // // //
// // // // // // //
// // // // // // // for (let j = 0; j < arr.length; j++) {
// // // // // // //     if (arr[j] % 3 === 0) {
// // // // // // //         arr[j] = 'OWU'
// // // // // // //     }
// // // // // // // }
// // // // // // //
// // // // // // //
// // // // // // // console.log(arr);
// // // // // //
// // // // // //
// // // // // // // for (let j = arr.length - 1; j > 0; j--) {
// // // // // // //     console.log(arr[j]);
// // // // // // // }
// // // // // //
// // // // // //
// // // // // // let odd = [];
// // // // // //
// // // // // // // while (odd.length < 50) {
// // // // // // //     let random = Math.round(Math.random()*100);
// // // // // // //
// // // // // // //     if (!(random % 2)) {  // if (random % 2 === 0)
// // // // // // //         odd.push(random)
// // // // // // //     }
// // // // // // // }
// // // // // // //
// // // // // // // for (let i = 0; i < 100; i+=2) { // ТО Є ЗЛЕ !
// // // // // // //     odd.push(i)
// // // // // // // }
// // // // // // // console.log(odd);
// // // // // // // console.log(odd.length);
// // // // // //
// // // // // //
// // // // // // // 4. вывести на консоль  каждый третий елемент но при условии что он имеет парное значение и записать их в другой массив.
// // // // // // // 5. Вывести каждый елемент массива у которого соседний с права элемент - парный
// // // // // // // 5 масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. обрахувати середній чек.
// // // // // // //
// // // // // // // 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// // // // // // // 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// // // // // // // додати його в інший масив.
// // // // // //
// // // // // // // біле === біле, // TRUE
// // // // // // // !біле === чорне  // TRUE
// // // // // //
// // // // // //
// // // // // // let randNumbs = [];
// // // // // //
// // // // // // while (randNumbs.length < 25) {
// // // // // //     let ramdom = Math.random() * (732 - 8) + 8;
// // // // // //     randNumbs.push(+ramdom.toFixed(0))
// // // // // // }
// // // // // //
// // // // // //
// // // // // // console.log(randNumbs);
// // // // // // console.log(randNumbs.length);
// // // // // //
// // // // // //
// // // // // // let x = 6.56738409342;
// // // // // //
// // // // // // console.time('PARSE');
// // // // // //
// // // // // // let p = parseInt(x.toString());
// // // // // //
// // // // // // console.timeEnd('PARSE');
// // // // // //
// // // // // // console.time("FIXED");
// // // // // //     let f = +x.toFixed(0)
// // // // // // console.timeEnd("FIXED");
// // // // // //
// // // // // //
// // // // // // console.time("ROUND");
// // // // // // let r = Math.round(x)
// // // // // // console.timeEnd("ROUND");
// // // // // //
// // // // // //
// // // // // // console.log(311 / 6)
// // // // // //
// // // // // //
// // // // // // let randNumbs = [];
// // // // // // let evenNumbs = [];
// // // // // //
// // // // // // while (randNumbs.length < 25) {
// // // // // //     let ramdom = Math.random() * (732 - 8) + 8;
// // // // // //     randNumbs.push(+ramdom.toFixed(0))
// // // // // // }
// // // // // //
// // // // // // for (let i = 0; i < randNumbs.length; i += 3) {
// // // // // //     if (randNumbs[i] % 2 !== 0) { //  if (!(randNumbs[i] % 2))
// // // // // //         evenNumbs.push(randNumbs[i])
// // // // // //     }
// // // // // // }
// // // // // //
// // // // // // console.log(evenNumbs);
// // // // // // console.log('_________________');
// // // // // // console.log(randNumbs);
// // // // //
// // // // //
// // // // // let numbers = [2, 17, 13, 6, 22, 31, 45, 66, 100, 19, 101, 250, 50, 169, 120, 345, 188];
// // // // //
// // // // // // for (let i = 0; i < numbers.length; i++) {
// // // // // //     if (numbers[i + 1] % 2 === 0) { // if (!(numbers[i + 1] % 2))
// // // // // //         console.log(numbers[i]);
// // // // // //     }
// // // // // // }
// // // // //
// // // // // let allPrices = 0;
// // // // //
// // // // // for (const number of numbers) {
// // // // //     allPrices += number;
// // // // // }
// // // // //
// // // // // console.log(allPrices);
// // // // //
// // // // // const avgPrice = allPrices / numbers.length;
// // // // //
// // // // // console.log(avgPrice);
// // // // //
// // // //
// // // // // // 3 створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
// // // // // // 4 створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо об'єкт є числом,
// // // // // // додати його в інший масив.
// // // //
// // // // // let numbers = [2, 17, 13, 6, 22, 31, 45, 66, 100, 19, 101, 250, 50, 169, 120, 345, 188];
// // // // //
// // // // // let newArr = [];
// // // // //
// // // // // for (const number of numbers) {
// // // // //     newArr.push(number * 5)
// // // // // }
// // // // // console.log(newArr);
// // // //
// // // // let smth = [true, 12, 'Str', false, 'Dima', 'Katya', 63, 9, '-0', true];
// // // // let smthNumbs = [];
// // // //
// // // // for (const smthElement of smth) {
// // // //     if (typeof smthElement === 'number') {
// // // //         smthNumbs.push(smthElement)
// // // //     }
// // // // }
// // // //
// // // // console.log(smthNumbs);
// // // //
// // // //
// // // // // Створити обєкт автомобіля з полями:
// // // // //     Марка автомобля, потужність двигуна, власник, ціна, рік випуску.
// // // // //     Власник автомобіля теж має бути обєкт, у якого є поля
// // // // // Імя, вік, стаж водіння.
// // // // //     Створити не менше 7 та не більше 20 машинок.
// // // // //     Зробили половину автопарку ремонт мотору, що збільшить потужність автомобілів на 10% (переприсвоєння змінної потужності).
// // // // // На відремонтовані автомобілі найняти нових водіїв (переприсвоїти змінну водій).
// // // // // Для початку вкладіть всі наші створені автомобілі в масив cars.
// // // // //     Далі необхідно рати кожну другу машинку (цикл з кроком в 2), та робити їй підвищення потужності двигуна на 10% та ціну на 5%
// // // // // Після того зробити перевірку досвіду ВСІХ наших водіїв. Якщо досвід водія менший за 5 років, але його вік більший за 25, то необідно відправити його на курси підвищення кваліфікації, що збільшить йому досвід на 1 рік.
// // // // //     Також спробуйте порахувати суму, яку потрібно потратити для покупки всіх цих авто в циклі
// // // // //
// // // // //
// // // // // Задача: дан отсортированный по возрастанию массив целых чисел. Необходимо вернуть наименьший и наибольший индекс заданного элемента.
// // // // //     Входные данные: arr — массив целых чисел по модулю не больше 10⁵. Размер массива не более 10⁶.
// // // // // Вывод: наибольший и наименьший индекс в массиве заданного элемента. Если такого элемента нет в массиве, выведите -1.
// // // // //
// // // // // Пример:
// // // // //     Arr = [1, 2, 3, 4, 4, 4, 4, 7, 7, 9, 14]
// // // // // 1. Key = 1
// // // // // Answer: MinIndex = 0, MaxIndex = 0.
// // // // // 2. Key = 4
// // // // // Answer: MinIndex = 3, MaxIndex = 6.
// // // //
// // // //
// // // // let arr = [1, 2, 3, 4, 4, 4, 4, 7, 7, 9, 14, 1, 2];
// // // //
// // // // let minIndex = undefined;
// // // // let maxIndex = undefined;
// // // //
// // // // let key = 2;
// // // // for (let i = 0; i < arr.length; i++) {
// // // //
// // // //     if (arr[i] === key) {
// // // //         maxIndex = i;
// // // //
// // // //         if (minIndex === undefined) {
// // // //             minIndex = i
// // // //         }
// // // //     }
// // // //
// // // //
// // // // console.log(minIndex);
// // // // console.log(maxIndex);
// // //
// // // // створити методи які :
// // // // 1. приймає три числа та виводить та повертає найменьше.
// // // // 2. приймає три числа та виводить та повертає найбільше.
// // //
// // // // 3. приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше // ARGUMENTS
// // // // 8. приймає масив та число (i). та міняє місцями об`єкт який знаходиться в індексі "i" на "i+1"
// // //
// // // // function first(a, b, c) {
// // // //     if (a > b && b > c) {  //  3 2 1
// // // //         console.log(c);
// // // //         return c;
// // // //     }
// // // //
// // // //     if (a > b && b < c) { // 3 1 2
// // // //         console.log(b);
// // // //         return b;
// // // //     }
// // // //
// // // //     if (a < b && b < c) { // 1 2 3
// // // //         console.log(a);
// // // //         return a;
// // // //     }
// // // //
// // // //     if (a < b && b > c) { // 1 3 2
// // // //         console.log(a);
// // // //         return a;
// // // //     }
// // // //
// // // //     if (a < b && b > c) { // 2 3 1
// // // //         console.log(a);
// // // //         return a;
// // // //     }
// // // // }
// // // //
// // // // console.log(first(3, 2, 1));
// // // //
// // // //
// // // // function findBiggest(arr) {
// // // //     let biggest = arr[0];
// // // //
// // // //     for (const num of arr) {
// // // //         if (num > biggest) {
// // // //             biggest = num;
// // // //         }
// // // //     }
// // // //
// // // //     return biggest
// // // // }
// // // //
// // // // console.log(findBiggest([8, 999, 5, 656, 23, 5]));
// // //
// // // function arrChanger(arr, i) {
// // //     let nextNum = arr[i + 1];
// // //
// // //     arr[i + 1] = arr[i];
// // //     arr[i] = nextNum;
// // //
// // //     console.log(arr);
// // // }
// // //
// // //
// // // arrChanger([5, 9, 1, 4, 0, 5], 0);
// //
// //
// // let obj = {
// //     name: 'Viktor',
// //     car: false,
// //     money: 0,
// //     girl: 'geekgirl'
// // };
// // //
// // // let name = obj.name;
// // // let money = obj.money;
// // // let girl = obj.girl;
// // // let car = obj.car;
// // //
// // // const girl = 'Olga';
// // //
// // // let {
// // //     car,
// // //     girl: superGirl,
// // //     money,
// // //     name
// // // } = obj;
// // //
// // // // console.log(car);
// // // // console.log(girl);
// // // // console.log(superGirl);
// // //
// // //
// // // let arr = [false, 'Hello', 'Car', 567, 0, true];
// // // let arr2 = [1, 6, 8, 0, 'RRR'];
// // //
// // // // let [, greet, wheel, , xxx] = arr;
// // // //
// // // // console.log(greet);
// // // // console.log(wheel);
// // // // console.log(xxx);
// // //
// // // // let [bol, ...xxx] = arr;
// // // // console.log(bol);
// // // // console.log(xxx);
// // //
// // // console.log(arr);
// // //
// // //
// // // let newArr = [...arr, ...arr2];
// // //
// // // console.log(newArr);
// //
// // let myClone = {
// //     name: 'Viktor',
// //     car: 'LSD',
// //     house: 'BIG'
// // }
// // let { car, ...userWOGirl } = obj;
// //
// // let newMe = {...myClone, ...obj};
// //
// // // console.log(car);
// // // console.log(userWOGirl);
// // console.log(newMe);
// // function f(a, b = 0) {
// //     console.log(a + b)
// // }
// //
// // f(1);
// // f(1, 8, 0, 5);
//
//
//
// // приймає будь-яку кількість чисел, повертає найменьше, а виводить найбільше
//
// function f() {
//
//     console.log(arguments);
//     let min = arguments[0];
//     let max = arguments[0];
//
//     for (let i = 0; i < arguments.length; i++) {
//         if (arguments[i] > max) {
//             max = arguments[i]
//         }
//         if (arguments[i] < min) {
//             min = arguments[i]
//         }
//     }
//
//     console.log(max, 'MAX');
//     console.log(min, 'MIN');
// }
//
// f(1, 2, 51, 21, "das", "asd" );
